Revit 2026 API

# FamilyInstanceGetSpatialElementCalculationPoint Method

---

Gets the location of the calculation point for this instance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ GetSpatialElementCalculationPoint()
```
```vb
Public Function GetSpatialElementCalculationPoint As XYZ
```
```cpp
public:
XYZ^ GetSpatialElementCalculationPoint()
```
```fsharp
member GetSpatialElementCalculationPoint : unit -> XYZ
```

#### Return Value

XYZA 3d point.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown if this instance does not have a single calculation point. |

See HasSpatialElementCalculationPoint for reference.

#### Reference

FamilyInstance Class

Autodesk.Revit.DB Namespace